{"meals":[{"mealName":"General Tso\u0027s Chicken","mealIngredients":["Chicken Breast","Plain Flour","Egg","Starch","Baking Powder","Salt","Onion Salt","Garlic Powder","Water","Chicken Stock","Duck Sauce","Soy Sauce","Honey","Rice Vinegar","Sesame Seed Oil"],"mealMeasurements":["1 1/2 ","3/4 cup ","1","2 tbs","1 tbs","1 tsp ","1/2 tsp","1/4 tsp","3/4 cup ","1/2 cup ","1/4 cup","3 tbs","2 tbs","1 tbs","2 tbs"],"mealInstructions":"DIRECTIONS:\r\nSTEP 1 - SAUCE\r\nIn a bowl, add 2 Cups of water, 2 Tablespoon soy sauce, 2 Tablespoon white vinegar, sherry cooking wine, 1/4 Teaspoon white pepper, minced ginger, minced garlic, hot pepper, ketchup, hoisin sauce, and sugar.\r\nMix together well and set aside.\r\nSTEP 2 - MARINATING THE CHICKEN\r\nIn a bowl, add the chicken, 1 pinch of salt, 1 pinch of white pepper, 2 egg whites, and 3 Tablespoon of corn starch\r\nSTEP 3 - DEEP FRY THE CHICKEN\r\nDeep fry the chicken at 350 degrees for 3-4 minutes or until it is golden brown and loosen up the chicken so that they don\u0027t stick together.\r\nSet the chicken aside.\r\nSTEP 4 - STIR FRY\r\nAdd the sauce to the wok and then the broccoli and wait until it is boiling.\r\nTo thicken the sauce, whisk together 2 Tablespoon of cornstarch and 4 Tablespoon of water in a bowl and slowly add to your stir-fry until it\u0027s the right thickness.\r\nNext add in the chicken and stir-fry for a minute and serve on a plate","mealCategory":"Chicken","mealArea":"Chinese"},{"mealName":"Jerk chicken with rice \u0026 peas","mealIngredients":["Chicken Thighs","Lime","Spring Onions","Ginger","Garlic","Onion","Red Chilli","Thyme","Lime","Soy Sauce","Vegetable Oil","Brown Sugar","Allspice","Basmati Rice","Coconut Milk"],"mealMeasurements":["12","1/2 ","1  bunch","1 tbs chopped","3 cloves","1/2 ","3 chopped","1/2 teaspoon","Juice of 1","2 tbs","2 tbs","3 tbs","1 tbs","200g","400g"],"mealInstructions":"To make the jerk marinade, combine all the ingredients in a food processor along with 1 tsp salt, and blend to a purée. If you’re having trouble getting it to blend, just keep turning off the blender, stirring the mixture, and trying again. Eventually it will start to blend up – don’t be tempted to add water, as you want a thick paste.\r\n\r\nTaste the jerk mixture for seasoning – it should taste pretty salty, but not unpleasantly, puckering salty. You can now throw in more chillies if it’s not spicy enough for you. If it tastes too salty and sour, try adding in a bit more brown sugar until the mixture tastes well balanced.\r\n\r\nMake a few slashes in the chicken thighs and pour the marinade over the meat, rubbing it into all the crevices. Cover and leave to marinate overnight in the fridge.\r\n\r\nIf you want to barbecue your chicken, get the coals burning 1 hr or so before you’re ready to cook. Authentic jerked meats are not exactly grilled as we think of grilling, but sort of smoke-grilled. To get a more authentic jerk experience, add some wood chips to your barbecue, and cook your chicken over slow, indirect heat for 30 mins. To cook in the oven, heat to 180C/160C fan/gas 4. Put the chicken pieces in a roasting tin with the lime halves and cook for 45 mins until tender and cooked through.\r\n\r\nWhile the chicken is cooking, prepare the rice \u0026 peas. Rinse the rice in plenty of cold water, then tip it into a large saucepan with all the remaining ingredients except the kidney beans. Season with salt, add 300ml cold water and set over a high heat. Once the rice begins to boil, turn it down to a medium heat, cover and cook for 10 mins.\r\n\r\nAdd the beans to the rice, then cover with a lid. Leave off the heat for 5 mins until all the liquid is absorbed. Squeeze the roasted lime over the chicken and serve with the rice \u0026 peas, and some hot sauce if you like it really spicy.","mealCategory":"Chicken","mealArea":"Jamaican"},{"mealName":"Chicken Quinoa Greek Salad","mealIngredients":["Quinoa","Butter","Red Chilli","Garlic","Chicken Breast","Olive Oil","Black Olives","Red Onions","Feta","Mint","Lemon"],"mealMeasurements":["225g","25g","1 chopped","1 clove finely chopped","400g","2 tbs","Handful","1 chopped","100g ","Chopped","Juice of 1/2"," "," "," "," "],"mealInstructions":"Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.\r\n\r\nMeanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.\r\n\r\nNext, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices.","mealCategory":"Chicken","mealArea":"Greek"},{"mealName":"Potato Gratin with Chicken","mealIngredients":["Potatoes","Onions","Olive Oil","Chicken Stock","Creme Fraiche","Parmesan","Chicken Breasts","Bacon","Spinach","Peas"],"mealMeasurements":["800g","3","2 tblsp","100ml","1 pot","Topping","4","4","Topping","Topping"],"mealInstructions":"15 minute potato gratin with chicken and bacon greens: a gratin always seems more effort and more indulgent than ordinary boiled or roasts, but it doesn\u0027t have to take 45mins, it\u0027s nice for a change and you can control the calorie content by going with full fat to low fat creme fraiche. (It\u0027s always tastes better full fat though obviously!) to serve 4: use 800g of potatoes, finely slice and boil in a pan for about 5-8 mins till firmish, not soft. Finely slice 3 onions and place in an oven dish with 2 tblsp of olive oil and 100ml of chicken stock. Cook till the onions are soft then drain the potatoes and pour onto the onions. Season and spoon over cream or creme fraiche till all is covered but not swimming. Grate Parmesan over the top then finish under the grill till nicely golden. serve with chicken and bacon, peas and spinach.","mealCategory":"Chicken","mealArea":"Unknown"},{"mealName":"Chicken Ham and Leek Pie","mealIngredients":["Chicken Stock","Chicken Breast","Butter","Leek","Garlic","Plain Flour","Milk","White Wine","Double Cream","Ham","Sea Salt","Pepper","Plain Flour","Butter","Free-range Egg, Beaten"],"mealMeasurements":["450ml","3","75g","2 sliced","2 cloves minced","50g","200ml","3 tbs","150ml","150g","spinkling","pinch","350g","200g","1"],"mealInstructions":"Heat the chicken stock in a lidded saucepan. Add the chicken breast and bring to a low simmer. Cover with a lid and cook for 10 minutes. Remove the chicken breasts from the water with tongs and place on a plate. Pour the cooking liquor into a large jug.\r\nMelt 25g/1oz of the butter in a large heavy-based saucepan over a low heat. Stir in the leeks and fry gently for two minutes, stirring occasionally until just softened. Add the garlic and cook for a further minute. Add the remaining butter and stir in the flour as soon as the butter has melted. Cook for 30 seconds, stirring constantly.\r\nSlowly pour the milk into the pan, just a little at a time, stirring well between each adding. Gradually add 250ml/10fl oz of the reserved stock and the wine, if using, stirring until the sauce is smooth and thickened slightly. Bring to a gentle simmer and cook for 3 minutes.\r\nSeason the mixture, to taste, with salt and freshly ground black pepper. Remove from the heat and stir in the cream. Pour into a large bowl and cover the surface of the sauce with cling ilm to prevent a skin forming. Set aside to cool.\r\nPreheat the oven to 200C/400F/Gas 6. Put a baking tray in the oven to heat.\r\nFor the pastry, put the flour and butter in a food processor and blend on the pulse setting until the mixture resembles fine breadcrumbs. With the motor running, add the beaten egg and water and blend until the mixture forms a ball. Portion off 250g/10oz of pastry for the lid.\r\nRoll the remaining pastry out on a lightly floured surface, turning the pastry frequently until around 5mm/¼in thick and 4cm/1½in larger than the pie dish. Lift the pastry over the rolling pin and place it gently into the pie dish. Press the pastry firmly up the sides, making sure there are no air bubbles. Leave the excess pastry overhanging the sides.\r\nCut the chicken breasts into 3cm/1¼in pieces. Stir the chicken, ham and leeks into the cooled sauce. Pour the chicken filling into the pie dish. Brush the rim of the dish with beaten egg. Roll out the reserved pastry for the lid.\r\nCover the pie with the pastry lid and press the edges together firmly to seal. Trim any excess pastry.\r\nMake a small hole in the centre of the pie with the tip of a knife. Glaze the top of the pie with beaten egg. Bake on the preheated tray in the centre of the oven for 35-40 minutes or until the pie is golden-brown all over and the filling is piping hot.","mealCategory":"Chicken","mealArea":"British"},{"mealName":"Mediterranean Pasta Salad","mealIngredients":["mozzarella balls","baby plum tomatoes","fresh basil","farfalle","extra virgin olive oil","Green Olives","tuna","salt","pepper"],"mealMeasurements":["200 g","250 g","1  bunch","350 g","3  tablespoons","40 g","200 g","to taste","to taste"],"mealInstructions":"Bring a large saucepan of salted water to the boil\r\nAdd the pasta, stir once and cook for about 10 minutes or as directed on the packet.\r\nMeanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil.\r\nPut the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix.\r\nWhen the pasta is ready, drain into a colander and run cold water over it to cool it quickly.\r\nToss the pasta into the salad bowl with the tomatoes and basil.\r\nAdd the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.\r\nSprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving.","mealCategory":"Seafood","mealArea":"Italian"},{"mealName":"Spicy North African Potato Salad","mealIngredients":["Small Potatoes","Harissa Spice","olive oil","Lemon","Spring onions","Rocket","Feta","Mint","Pine nuts","Salt","Pepper"],"mealMeasurements":["650g/1lb 8 oz","1 tsp","2 tsp","juice of half","4","150g/6oz","80g/3oz","20 chopped","2 tablespoons","Pinch","Pinch"],"mealInstructions":"Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or until potatoes are tender. You know they are cooked when you can stick a knife in them and the knife goes straight through.\r\nCombine harissa spice, olive oil, salt and pepper and lemon juice in a small bowl and whisk until combined.\r\nOnce potatoes are cooked, drain water and roughly chop potatoes in half.\r\nAdd harissa mix and spring onions/green onions to potatoes and stir.\r\nIn a large salad bowl, lay out arugula/rocket.\r\nTop with potato mix and toss.\r\nAdd fetta, mint and sprinkle over pine nuts.\r\nAdjust salt and pepper to taste.","mealCategory":"Vegetarian","mealArea":"Moroccan"},{"mealName":"Salmon Avocado Salad","mealIngredients":["Salmon","Avocado","Cucumber","Spinach","Mint","Lime","Honey","Olive Oil"],"mealMeasurements":["400g","3","1","400g","4 tbs","zest and juice of 1","2 tsp","3 tbs"],"mealInstructions":"Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.\r\n\r\nHeat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm.","mealCategory":"Seafood","mealArea":"British"},{"mealName":"Chicken Basquaise","mealIngredients":["Chicken","Butter","Olive Oil","Red Onions","Red Pepper","Chorizo","Sun-Dried Tomatoes","Garlic","Basmati Rice","Tomato Puree","Paprika","Bay Leaves","Thyme","Chicken Stock","Dry White Wine"],"mealMeasurements":["1.5kg","25g","6 tblsp","2 sliced","3 Large","130g","8","6 cloves sliced","300g","drizzle","½ tsp","4","Handful","350ml","180g"],"mealInstructions":"Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don\u0027t crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn\u0027t already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.","mealCategory":"Chicken","mealArea":"French"},{"mealName":"Brown Stew Chicken","mealIngredients":["Chicken","Tomato","Onions","Garlic Clove","Red Pepper","Carrots","Lime","Thyme","Allspice","Soy Sauce","Cornstarch","Coconut Milk","Vegetable Oil"],"mealMeasurements":["1 whole","1 chopped","2 chopped","2 chopped","1 chopped","1 chopped","1","2 tsp","1 tsp ","2 tbs","2 tsp","2 cups ","1 tbs"],"mealInstructions":"Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.","mealCategory":"Chicken","mealArea":"Jamaican"},{"mealName":"Chicken Karaage","mealIngredients":["Chicken thigh","Ginger","Garlic","Soy sauce","Sake","Granulated sugar","Potato starch","Vegetable oil","Lemon"],"mealMeasurements":["450 grams Boneless skin","1 tablespoon","1 clove","2 tablespoons","1 tablespoon","2 teaspoon","1/3 cup","1/3 cup","1/3 cup"],"mealInstructions":"Add the ginger, garlic, soy sauce, sake and sugar to a bowl and whisk to combine. Add the chicken, then stir to coat evenly. Cover and refrigerate for at least 1 hour.\r\n\r\nAdd 1 inch of vegetable oil to a heavy bottomed pot and heat until the oil reaches 360 degrees F. Line a wire rack with 2 sheets of paper towels and get your tongs out. Put the potato starch in a bowl\r\n\r\nAdd a handful of chicken to the potato starch and toss to coat each piece evenly.\r\n\r\nFry the karaage in batches until the exterior is a medium brown and the chicken is cooked through. Transfer the fried chicken to the paper towel lined rack. If you want the karaage to stay crispy longer, you can fry the chicken a second time, until it\u0027s a darker color after it\u0027s cooled off once. Serve with lemon wedges.","mealCategory":"Chicken","mealArea":"Japanese"},{"mealName":"Chicken Alfredo Primavera","mealIngredients":["Butter","Olive Oil","Chicken","Salt","Squash","Broccoli","mushrooms","Pepper","onion","garlic","red pepper flakes","white wine","milk","heavy cream","Parmesan cheese"],"mealMeasurements":["2 tablespoons","3 tablespoons","5 boneless","1 teaspoon","1 cut into 1/2-inch cubes","1 Head chopped","8-ounce sliced","1 red","1 chopped","3 cloves","1/2 teaspoon","1/2 cup","1/2 cup","1/2 cup","1 cup grated"],"mealInstructions":"Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. ","mealCategory":"Chicken","mealArea":"Italian"},{"mealName":"Piri-piri chicken and slaw","mealIngredients":["Chicken","Red Chilli","Garlic","Ginger","Dried Oregano","Coriander","Paprika","Red Wine Vinegar","Oil","Red Onions","Carrots","Beetroot","Cabbage","Mayonnaise","Greek Yogurt"],"mealMeasurements":["1.5kg","3 chopped","2 cloves","1 tsp ","1 tsp ","1 tsp ","1 tsp ","2 tbs","2 tbs","1 sliced","2","1","4 leaves","2 tbs","2 tbs"],"mealInstructions":"STEP 1\r\n\r\nWhizz together all of the marinade ingredients in a small food processor. Rub the marinade onto the chicken and leave for 1 hour at room temperature.\r\n\r\nSTEP 2\r\n\r\nHeat the oven to 190C/fan 170C/gas 5. Put the chicken in a roasting tray and cook for 1 hour 20 minutes. Rest under loose foil for 20 minutes. While the chicken is resting, mix together the slaw ingredients and season. Serve the chicken with slaw, fries and condiments.","mealCategory":"Chicken","mealArea":"Portuguese"},{"mealName":"Chicken Fajita Mac and Cheese","mealIngredients":["macaroni","chicken stock","heavy cream","fajita seasoning","salt","chicken breast","olive oil","onion","red pepper","garlic","cheddar cheese","parsley"],"mealMeasurements":["500g","2 cups","1/2 cup","1 packet","1 tsp","3 diced","2 tbsp","1 small finely diced","2 finely diced","2 cloves minced","1 cup","garnish chopped"],"mealInstructions":"Fry your onion, peppers and garlic in olive oil until nicely translucent. Make a well in your veg and add your chicken. Add your seasoning and salt. Allow to colour slightly.\r\nAdd your cream, stock and macaroni.\r\nCook on low for 20 minutes. Add your cheeses, stir to combine.\r\nTop with roasted peppers and parsley.","mealCategory":"Chicken","mealArea":"American"},{"mealName":"Kentucky Fried Chicken","mealIngredients":["Chicken","Oil","Egg White","Flour","Brown Sugar","Salt","paprika","onion salt","chili powder","black pepper","celery salt","sage","garlic powder","allspice","oregano"],"mealMeasurements":["1 whole","2 quarts neutral frying","1","1 1/2 cups ","1 tablespoon","1 tablespoon","1 tablespoon","2 teaspoons","1 teaspoon","1 teaspoon","1/2 teaspoon","1/2 teaspoon","1/2 teaspoon","1/2 teaspoon","1/2 teaspoon"],"mealInstructions":"Preheat fryer to 350°F. Thoroughly mix together all the spice mix ingredients.\r\nCombine spice mix with flour, brown sugar and salt.\r\nDip chicken pieces in egg white to lightly coat them, then transfer to flour mixture. Turn a few times and make sure the flour mix is really stuck to the chicken. Repeat with all the chicken pieces.\r\nLet chicken pieces rest for 5 minutes so crust has a chance to dry a bit.\r\nFry chicken in batches. Breasts and wings should take 12-14 minutes, and legs and thighs will need a few more minutes. Chicken pieces are done when a meat thermometer inserted into the thickest part reads 165°F.\r\nLet chicken drain on a few paper towels when it comes out of the fryer. Serve hot.","mealCategory":"Chicken","mealArea":"American"},{"mealName":"Katsu Chicken curry","mealIngredients":["chicken breast","plain flour","egg","breadcrumbs","vegetable oil","sunflower oil","onions","garlic","carrot","plain flour","curry powder","chicken stock","honey","soy sauce","bay leaf"],"mealMeasurements":["4 pounded to 1cm thickness","2 tablespoons","1 beaten","100g fine","230ml frying","2 tablespoons","2 sliced","5 chopped cloves","2 sliced","2 tablespoons","4 teaspoons","600ml","2 teaspoons","4 teaspoons","1"],"mealInstructions":"Prep:15min  ›  Cook:30min  ›  Ready in:45min \r\n\r\nFor the curry sauce: Heat oil in medium non-stick saucepan, add onion and garlic and cook until softened. Stir in carrots and cook over low heat for 10 to 12 minutes.\r\nAdd flour and curry powder; cook for 1 minute. Gradually stir in stock until combined; add honey, soy sauce and bay leaf. Slowly bring to the boil.\r\nTurn down heat and simmer for 20 minutes or until sauce thickens but is still of pouring consistency. Stir in garam masala. Pour the curry sauce through a sieve; return to saucepan and keep on low heat until ready to serve.\r\nFor the chicken: Season both sides of chicken breasts with salt and pepper. Place flour, egg and breadcrumbs in separate bowls and arrange in a row. Coat the chicken breasts in flour, then dip them into the egg, then coat in breadcrumbs, making sure you cover both sides.\r\nHeat oil in large frying pan over medium-high heat. Place chicken into hot oil and cook until golden brown, about 3 or 4 minutes each side. Once cooked, place on kitchen paper to absorb excess oil.\r\nPour curry sauce over chicken, serve with white rice and enjoy!","mealCategory":"Chicken","mealArea":"Japanese"},{"mealName":"Chicken Enchilada Casserole","mealIngredients":["Enchilada sauce","shredded Monterey Jack cheese","corn tortillas","chicken breasts"],"mealMeasurements":["14 oz jar","3 Cups","6","2"],"mealInstructions":"Cut each chicken breast in about 3 pieces, so that it cooks faster and put it in a small pot. Pour Enchilada sauce over it and cook covered on low to medium heat until chicken is cooked through, about 20 minutes. No water is needed, the chicken will cook in the Enchilada sauce. Make sure you stir occasionally so that it doesn\u0027t stick to the bottom.\r\nRemove chicken from the pot and shred with two forks.\r\nPreheat oven to 375 F degrees.\r\nStart layering the casserole. Start with about ¼ cup of the leftover Enchilada sauce over the bottom of a baking dish. I used a longer baking dish, so that I can put 2 corn tortillas across. Place 2 tortillas on the bottom, top with ⅓ of the chicken and ⅓ of the remaining sauce. Sprinkle with ⅓ of the cheese and repeat starting with 2 more tortillas, then chicken, sauce, cheese. Repeat with last layer with the remaining ingredients, tortillas, chicken, sauce and cheese.\r\nBake for 20 to 30 minutes uncovered, until bubbly and cheese has melted and started to brown on top.\r\nServe warm.","mealCategory":"Chicken","mealArea":"Mexican"},{"mealName":"Chicken Quinoa Greek Salad","mealIngredients":["Quinoa","Butter","Red Chilli","Garlic","Chicken Breast","Olive Oil","Black Olives","Red Onions","Feta","Mint","Lemon"],"mealMeasurements":["225g","25g","1 chopped","1 clove finely chopped","400g","2 tbs","Handful","1 chopped","100g ","Chopped","Juice of 1/2"," "," "," "," "],"mealInstructions":"Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.\r\n\r\nMeanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.\r\n\r\nNext, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices.","mealCategory":"Chicken","mealArea":"Greek"},{"mealName":"Chicken Handi","mealIngredients":["Chicken","Onion","Tomatoes","Garlic","Ginger paste","Vegetable oil","Cumin seeds","Coriander seeds","Turmeric powder","Chilli powder","Green chilli","Yogurt","Cream","fenugreek","Garam masala"],"mealMeasurements":["1.2 kg","5 thinly sliced","2 finely chopped","8 cloves chopped","1 tbsp","¼ cup","2 tsp","3 tsp","1 tsp","1 tsp","2","1 cup","¾ cup","3 tsp Dried","1 tsp"],"mealInstructions":"Take a large pot or wok, big enough to cook all the chicken, and heat the oil in it. Once the oil is hot, add sliced onion and fry them until deep golden brown. Then take them out on a plate and set aside.\r\nTo the same pot, add the chopped garlic and sauté for a minute. Then add the chopped tomatoes and cook until tomatoes turn soft. This would take about 5 minutes.\r\nThen return the fried onion to the pot and stir. Add ginger paste and sauté well.\r\nNow add the cumin seeds, half of the coriander seeds and chopped green chillies. Give them a quick stir.\r\nNext goes in the spices – turmeric powder and red chilli powder. Sauté the spices well for couple of minutes.\r\nAdd the chicken pieces to the wok, season it with salt to taste and cook the chicken covered on medium-low heat until the chicken is almost cooked through. This would take about 15 minutes. Slowly sautéing the chicken will enhance the flavor, so do not expedite this step by putting it on high heat.\r\nWhen the oil separates from the spices, add the beaten yogurt keeping the heat on lowest so that the yogurt doesn’t split. Sprinkle the remaining coriander seeds and add half of the dried fenugreek leaves. Mix well.\r\nFinally add the cream and give a final mix to combine everything well.\r\nSprinkle the remaining kasuri methi and garam masala and serve the chicken handi hot with naan or rotis. Enjoy!","mealCategory":"Chicken","mealArea":"Indian"},{"mealName":"Tandoori chicken","mealIngredients":["lemons","paprika","red onions","chicken thighs","vegetable oil","Greek yogurt","ginger","garlic clove","garam masala","ground cumin","chilli powder","turmeric"],"mealMeasurements":["2 Juice","4 tsp","2 finely chopped","16 skinnless","For brushing","300ml ","large piece","4","¾ tsp","¾ tsp","½ tsp","¼ tsp"],"mealInstructions":"Mix the lemon juice with the paprika and red onions in a large shallow dish. Slash each chicken thigh three times, then turn them in the juice and set aside for 10 mins.\r\nMix all of the marinade ingredients together and pour over the chicken. Give everything a good mix, then cover and chill for at least 1 hr. This can be done up to a day in advance.\r\nHeat the grill. Lift the chicken pieces onto a rack over a baking tray. Brush over a little oil and grill for 8 mins on each side or until lightly charred and completely cooked through.","mealCategory":"Chicken","mealArea":"Indian"},{"mealName":"Chicken Couscous","mealIngredients":["Olive Oil","Onion","Chicken Breast","Ginger","Harissa Spice","Dried Apricots","Chickpeas","Couscous","Chicken Stock","Coriander"],"mealMeasurements":["1 tbsp","1 chopped","200g","pinch","2 tblsp ","10","220g","200g","200ml","Handful"],"mealInstructions":"Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\n\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.","mealCategory":"Chicken","mealArea":"Moroccan"},{"mealName":"Nutty Chicken Curry","mealIngredients":["Red Chilli","Ginger","Garlic","Coriander","Sunflower Oil","Chicken Breasts","Peanut Butter","Chicken Stock","Greek Yogurt"],"mealMeasurements":["1 large","0.5","1 large","Bunch","1 tbsp","4","5 tblsp ","150ml","200g"],"mealInstructions":"Finely slice a quarter of the chilli, then put the rest in a food processor with the ginger, garlic, coriander stalks and one-third of the leaves. Whizz to a rough paste with a splash of water if needed.\r\nHeat the oil in a frying pan, then quickly brown the chicken chunks for 1 min. Stir in the paste for another min, then add the peanut butter, stock and yogurt. When the sauce is gently bubbling, cook for 10 mins until the chicken is just cooked through and sauce thickened. Stir in most of the remaining coriander, then scatter the rest on top with the chilli, if using. Eat with rice or mashed sweet potato.","mealCategory":"Chicken","mealArea":"Indian"},{"mealName":"Chicken Quinoa Greek Salad","mealIngredients":["Quinoa","Butter","Red Chilli","Garlic","Chicken Breast","Olive Oil","Black Olives","Red Onions","Feta","Mint","Lemon"],"mealMeasurements":["225g","25g","1 chopped","1 clove finely chopped","400g","2 tbs","Handful","1 chopped","100g ","Chopped","Juice of 1/2"," "," "," "," "],"mealInstructions":"Cook the quinoa following the pack instructions, then rinse in cold water and drain thoroughly.\r\n\r\nMeanwhile, mix the butter, chilli and garlic into a paste. Toss the chicken fillets in 2 tsp of the olive oil with some seasoning. Lay in a hot griddle pan and cook for 3-4 mins each side or until cooked through. Transfer to a plate, dot with the spicy butter and set aside to melt.\r\n\r\nNext, tip the tomatoes, olives, onion, feta and mint into a bowl. Toss in the cooked quinoa. Stir through the remaining olive oil, lemon juice and zest, and season well. Serve with the chicken fillets on top, drizzled with any buttery chicken juices.","mealCategory":"Chicken","mealArea":"Greek"},{"mealName":"Crock Pot Chicken Baked Tacos","mealIngredients":["Chicken Breasts","Vinaigrette Dressing","Cumin","Smoked Paprika","Garlic","Refried Beans","Hard Taco Shells","Shredded Mexican Cheese","Grape Tomatoes","Jalapeno","Avocado","Green Salsa","Sour Cream","Milk"],"mealMeasurements":["4 - 6","1 bottle","1½ tablespoon","1 tablespoon","1 teaspoon","1 can","12","2 cups","Halved","Sliced and Seeded","Peeled and Sliced","2 tablespoons","3 tablespoons","1 tablespoon"],"mealInstructions":"Put the uncooked chicken breasts in the crock pot. Pour the full bottle of salad dressing over the chicken. Sprinkle the rest of the ingredients over the top and mix them in a bit with a spoon.\r\nCover your crock pot with the lid and cook on high for 4 hours.\r\nRemove all the chicken breasts from the crock pot and let cool.\r\nShred the chicken breasts and move to a glass bowl.\r\nPour most of the liquid over the shredded chicken.\r\nFOR THE TACOS:\r\nMake the guacamole sauce by mixing the avocado and green salsa together. Pour the guacamole mixture through a strainer until smooth and transfer to a squeeze bottle. Cut the tip off the lid of the squeeze bottle to make the opening more wide if needed.\r\nMake the sour cream sauce by mixing the sour cream and milk together until you get a more liquid sour cream sauce. Transfer to a squeeze bottle.\r\nIn a 9x 13 glass baking dish, fill all 12+ tacos with a layer of refried beans, cooked chicken and shredded cheese.\r\nBake at 450 for 10-15 minutes just until the cheese is melted and bubbling.\r\nOut of the oven top all the tacos with the sliced grape tomaotes, jalapeno and cilantro.\r\nFinish with a drizzle of guacamole and sour cream.\r\nEnjoy!","mealCategory":"Chicken","mealArea":"Mexican"},{"mealName":"Kung Pao Chicken","mealIngredients":["Sake","Soy Sauce","Sesame Seed Oil","Corn Flour","Water","Chicken","Chilli Powder","Rice Vinegar","Brown Sugar","Spring Onions","Garlic Clove","Water Chestnut","Peanuts"],"mealMeasurements":["2 tbs","2 tbs","2 tbs","2 tbs","2 tbs","500g","1 tbs","1 tsp ","1 tbs","4 Chopped","6 cloves","220g","100g "],"mealInstructions":"Combine the sake or rice wine, soy sauce, sesame oil and cornflour dissolved in water. Divide mixture in half.\r\nIn a glass dish or bowl, combine half of the sake mixture with the chicken pieces and toss to coat. Cover dish and place in refrigerator for about 30 minutes.\r\nIn a medium frying pan, combine remaining sake mixture, chillies, vinegar and sugar. Mix together and add spring onion, garlic, water chestnuts and peanuts. Heat sauce slowly over medium heat until aromatic.\r\nMeanwhile, remove chicken from marinade and sauté in a large frying pan until juices run clear. When sauce is aromatic, add sautéed chicken and let simmer together until sauce thickens.","mealCategory":"Chicken","mealArea":"Chinese"},{"mealName":"Spicy North African Potato Salad","mealIngredients":["Small Potatoes","Harissa Spice","olive oil","Lemon","Spring onions","Rocket","Feta","Mint","Pine nuts","Salt","Pepper"],"mealMeasurements":["650g/1lb 8 oz","1 tsp","2 tsp","juice of half","4","150g/6oz","80g/3oz","20 chopped","2 tablespoons","Pinch","Pinch"],"mealInstructions":"Cook potatoes - place potatoes in a pot of cold water, and bring to the boil. Boil 20 minutes, or until potatoes are tender. You know they are cooked when you can stick a knife in them and the knife goes straight through.\r\nCombine harissa spice, olive oil, salt and pepper and lemon juice in a small bowl and whisk until combined.\r\nOnce potatoes are cooked, drain water and roughly chop potatoes in half.\r\nAdd harissa mix and spring onions/green onions to potatoes and stir.\r\nIn a large salad bowl, lay out arugula/rocket.\r\nTop with potato mix and toss.\r\nAdd fetta, mint and sprinkle over pine nuts.\r\nAdjust salt and pepper to taste.","mealCategory":"Vegetarian","mealArea":"Moroccan"},{"mealName":"Chicken Parmentier","mealIngredients":["Potatoes","Butter","Double Cream","Egg Yolks","Butter","Shallots","Carrots","Celery","Garlic Clove","White Wine","Tomato Puree","Tinned Tomatos","Chicken Stock","Chicken","Black Olives"],"mealMeasurements":["1.5kg","30g","5 tblsp ","2","30g","7","3 chopped","2 sticks","1 finely chopped ","4 tbsp","1 tbls","400g","350ml","600g","16"],"mealInstructions":"For the topping, boil the potatoes in salted water until tender. Drain and push through a potato ricer, or mash thoroughly. Stir in the butter, cream and egg yolks. Season and set aside.\r\nFor the filling, melt the butter in a large pan. Add the shallots, carrots and celery and gently fry until soft, then add the garlic. Pour in the wine and cook for 1 minute. Stir in the tomato purée, chopped tomatoes and stock and cook for 10–15 minutes, until thickened. Add the shredded chicken, olives and parsley. Season to taste with salt and pepper.\r\nPreheat the oven to 180C/160C Fan/Gas 4.\r\nPut the filling in a 20x30cm/8x12in ovenproof dish and top with the mashed potato. Grate over the Gruyère. Bake for 30–35 minutes, until piping hot and the potato is golden-brown.","mealCategory":"Chicken","mealArea":"French"},{"mealName":"Chicken Congee","mealIngredients":["Chicken","Salt","Pepper","Ginger Cordial","Ginger","Spring Onions","Rice","Water","Coriander"],"mealMeasurements":["8 oz ","pinch","pinch","1 tsp ","1 tsp ","1 tbs","1/2 cup ","8 cups ","2 oz "],"mealInstructions":"STEP 1 - MARINATING THE CHICKEN\r\nIn a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r\nSet the chicken aside.\r\nSTEP 2 - RINSE THE WHITE RICE\r\nRinse the rice in a metal bowl or pot a couple times and then drain the water.\r\nSTEP 2 - BOILING THE WHITE RICE\r\nNext add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r\nAfter 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r\nNext add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r\nAfter an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r\nServe the rice porridge in a bowl\r\nOptional: add Coriander on top of the rice porridge.","mealCategory":"Chicken","mealArea":"Chinese"},{"mealName":"Salmon Avocado Salad","mealIngredients":["Salmon","Avocado","Cucumber","Spinach","Mint","Lime","Honey","Olive Oil"],"mealMeasurements":["400g","3","1","400g","4 tbs","zest and juice of 1","2 tsp","3 tbs"],"mealInstructions":"Season the salmon, then rub with oil. Mix the dressing ingredients together. Halve, stone, peel and slice the avocados. Halve and quarter the cucumber lengthways, then cut into slices. Divide salad, avocado and cucumber between four plates, then drizzle with half the dressing.\r\n\r\nHeat a non-stick pan. Add the salmon and fry for 3-4 mins on each side until crisp but still moist inside. Put a salmon fillet on top of each salad and drizzle over the remaining dressing. Serve warm.","mealCategory":"Seafood","mealArea":"British"},{"mealName":"Teriyaki Chicken Casserole","mealIngredients":["soy sauce","water","brown sugar","ground ginger","minced garlic","cornstarch","chicken breasts","stir-fry vegetables","brown rice"],"mealMeasurements":["3/4 cup","1/2 cup","1/4 cup","1/2 teaspoon","1/2 teaspoon","4 Tablespoons","2","1 (12 oz.)","3 cups"],"mealInstructions":"Preheat oven to 350° F. Spray a 9x13-inch baking pan with non-stick spray.\r\nCombine soy sauce, ½ cup water, brown sugar, ginger and garlic in a small saucepan and cover. Bring to a boil over medium heat. Remove lid and cook for one minute once boiling.\r\nMeanwhile, stir together the corn starch and 2 tablespoons of water in a separate dish until smooth. Once sauce is boiling, add mixture to the saucepan and stir to combine. Cook until the sauce starts to thicken then remove from heat.\r\nPlace the chicken breasts in the prepared pan. Pour one cup of the sauce over top of chicken. Place chicken in oven and bake 35 minutes or until cooked through. Remove from oven and shred chicken in the dish using two forks.\r\n*Meanwhile, steam or cook the vegetables according to package directions.\r\nAdd the cooked vegetables and rice to the casserole dish with the chicken. Add most of the remaining sauce, reserving a bit to drizzle over the top when serving. Gently toss everything together in the casserole dish until combined. Return to oven and cook 15 minutes. Remove from oven and let stand 5 minutes before serving. Drizzle each serving with remaining sauce. Enjoy!","mealCategory":"Chicken","mealArea":"Japanese"},{"mealName":"Chicken Marengo","mealIngredients":["Olive Oil","Mushrooms","Chicken Legs","Passata","Chicken Stock Cube","Black Olives","Parsley"],"mealMeasurements":["1 tbs","300g","4","500g","1","100g ","Chopped"],"mealInstructions":"Heat the oil in a large flameproof casserole dish and stir-fry the mushrooms until they start to soften. Add the chicken legs and cook briefly on each side to colour them a little.\r\nPour in the passata, crumble in the stock cube and stir in the olives. Season with black pepper – you shouldn’t need salt. Cover and simmer for 40 mins until the chicken is tender. Sprinkle with parsley and serve with pasta and a salad, or mash and green veg, if you like.","mealCategory":"Chicken","mealArea":"French"},{"mealName":"Mediterranean Pasta Salad","mealIngredients":["mozzarella balls","baby plum tomatoes","fresh basil","farfalle","extra virgin olive oil","Green Olives","tuna","salt","pepper"],"mealMeasurements":["200 g","250 g","1  bunch","350 g","3  tablespoons","40 g","200 g","to taste","to taste"],"mealInstructions":"Bring a large saucepan of salted water to the boil\r\nAdd the pasta, stir once and cook for about 10 minutes or as directed on the packet.\r\nMeanwhile, wash the tomatoes and cut into quarters. Slice the olives. Wash the basil.\r\nPut the tomatoes into a salad bowl and tear the basil leaves over them. Add a tablespoon of olive oil and mix.\r\nWhen the pasta is ready, drain into a colander and run cold water over it to cool it quickly.\r\nToss the pasta into the salad bowl with the tomatoes and basil.\r\nAdd the sliced olives, drained mozzarella balls, and chunks of tuna. Mix well and let the salad rest for at least half an hour to allow the flavours to mingle.\r\nSprinkle the pasta with a generous grind of black pepper and drizzle with the remaining olive oil just before serving.","mealCategory":"Seafood","mealArea":"Italian"},{"mealName":"Chicken \u0026 mushroom Hotpot","mealIngredients":["Butter","Onion","Mushrooms","Plain Flour","Chicken Stock Cube","Nutmeg","Mustard Powder","Chicken","Sweetcorn","Potatoes","Butter"],"mealMeasurements":["50g","1 chopped","100g ","40g","1","pinch","pinch","250g","2 Handfuls","2 large","1 knob"],"mealInstructions":"Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r\n\r\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r\n\r\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r\n\r\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r\n\r\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.","mealCategory":"Chicken","mealArea":"British"}]}